/*******************************************************
器件型号：PT4115
通信方式：PWM
文件功能：通过控制TP4115管脚上的电压实现LED亮度调节
					电压越低亮度越低。
管脚连接：
				灯路1 -->TIM3_CH1 -->PA6
				灯路2 -->TIM3_CH2 -->PA7
				灯路3 -->TIM3_CH3 -->PB6
				灯路4 -->TIM3_CH4 -->PB1
*******************************************************/
#include "TP4115.h"
#include "Tim.h"

void PT4115_Init()
{
	TIM3_CH1234_Init(255,72-1);		//PWM初始化 ，参数：计数值  捕获值
	PT4115_Change(255,0,0,0);//使得所有路的高亮LED均熄灭
}
/******************************************************
函数名：PT4115_Change
函数功能：通过改变PWM的占空比实现调节光线亮度
函数参数：
				L1：高亮LED光路1调节亮度值
				L2：高亮LED光路2调节亮度值
				L3：高亮LED光路3调节亮度值
				L4：高亮LED光路4调节亮度值
******************************************************/
void PT4115_Change(u8 L1,u8 L2,u8 L3,u8 L4)
{
	TIM3->CCR1 = L1;
	TIM4->CCR1 = L2;
	TIM3->CCR3 = L3;
	TIM3->CCR4 = L4;
}
